Tekla Open API Reference for Tekla Structures 2025
LineSegment.EndPoint Property
 Gets the end point of the line segment
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point EndPoint { get; }
Public ReadOnly Property EndPoint As Point
	Get
Property Value
Type: Point
Implements
ICurve.EndPoint
See Also
Reference
LineSegment Class
Tekla.Structures.Geometry3d Namespace